CSI API ETABS v1

# cSapModel Properties

---

The cSapModel type exposes the
following members.

Properties

| Name| Description
---|---|---
|
Analyze|
|
AreaElm|
|
AreaObj|
|
ConstraintDef|
|
DatabaseTables|
|
DesignCompositeBeam|
|
DesignCompositeColumn|
|
DesignConcrete|
|
DesignConcreteSlab|
|
DesignResults|
|
DesignShearWall|
|
DesignSteel|
|
Detailing|
|
Diaphragm|
|
EditArea|
|
EditFrame|
|
EditGeneral|
|
EditPoint|
|
File|
|
FrameObj|
|
Func|
|
GDispl|
|
GridSys|
|
GroupDef|
|
LineElm|
|
LinkElm|
|
LinkObj|
|
LoadCases|
|
LoadPatterns|
| [Options](de0a14cc-
ab4e-d994-b07c-0d4129d71e91.htm)|
|
PatternDef|
|
PierLabel|
|
PointElm|
|
PointObj|
|
PropArea|
|
PropAreaSpring|
|
PropFrame|
|
PropLineSpring|
|
PropLink|
|
PropMaterial|
|
PropPointSpring|
|
PropRebar|
|
PropTendon|
|
RespCombo|
|
Results|  Gives access to API
calls related to analysis results.
|
SelectObj|
|
SpandrelLabel|
|
Story|
|
TendonObj|
| [Tower](c1631f6d-606d-4a41-b5ec-
fe3a9dff785b.htm)|
|
View|
Top

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com